In [ ]:
import numpy as np
import pandas as pd

In [ ]:
import numpy as np

mydict = {
    "income": (50, 25, 15, 10, np.nan, np.nan, 20, 10, np.nan, 999),
    "Age": (19, 20, 30, np.nan, np.nan, 25, 20, 52, 46, 9999)
}

mydict

{'income': (50, 25, 15, 10, nan, nan, 20, 10, nan, 999),
 'Age': (19, 20, 30, nan, nan, 25, 20, 52, 46, 9999)}

In [ ]:
mydata=pd.DataFrame(mydict)
mydata

   income     Age
0    50.0    19.0
1    25.0    20.0
2    15.0    30.0
3    10.0     NaN
4     NaN     NaN
5     NaN    25.0
6    20.0    20.0
7    10.0    52.0
8     NaN    46.0
9   999.0  9999.0

In [ ]:
#replace bogus values such as 9999with nan
mydata = mydata.replace((9999,999), np.nan)
mydata

   income   Age
0    50.0  19.0
1    25.0  20.0
2    15.0  30.0
3    10.0   NaN
4     NaN   NaN
5     NaN  25.0
6    20.0  20.0
7    10.0  52.0
8     NaN  46.0
9     NaN   NaN

In [ ]:
#Display values which are "Null' with 'True'
mydata.isnull()

   income    Age
0   False  False
1   False  False
2   False  False
3   False   True
4    True   True
5    True  False
6   False  False
7   False  False
8    True  False
9    True   True

In [ ]:
#Drop any rows where there are any columns missing values
new=mydata.dropna(how='any')
new

   income   Age
0    50.0  19.0
1    25.0  20.0
2    15.0  30.0
6    20.0  20.0
7    10.0  52.0

In [ ]:
#Drop any rows where there are all columns missing values
new=mydata.dropna(how='all')
new

   income   Age
0    50.0  19.0
1    25.0  20.0
2    15.0  30.0
3    10.0   NaN
5     NaN  25.0
6    20.0  20.0
7    10.0  52.0
8     NaN  46.0

In [ ]:
#Replace missing values with mean of respective columns
new=np.round(mydata.fillna(mydata.mean()),1)
new

   income   Age
0    50.0  19.0
1    25.0  20.0
2    15.0  30.0
3    10.0  30.3
4    21.7  30.3
5    21.7  25.0
6    20.0  20.0
7    10.0  52.0
8    21.7  46.0
9    21.7  30.3

In [ ]:
#Replace missing values with median of respective columns
new=np.round(mydata.fillna(mydata.mean()),1)
new

   income   Age
0    50.0  19.0
1    25.0  20.0
2    15.0  30.0
3    10.0  30.3
4    21.7  30.3
5    21.7  25.0
6    20.0  20.0
7    10.0  52.0
8    21.7  46.0
9    21.7  30.3

In [ ]:
#Replace missing values with any numbers of your choice
new=np.round(mydata.fillna({'Age':30,'income':15}))
new

   income   Age
0    50.0  19.0
1    25.0  20.0
2    15.0  30.0
3    10.0  30.0
4    15.0  30.0
5    15.0  25.0
6    20.0  20.0
7    10.0  52.0
8    15.0  46.0
9    15.0  30.0

Pandas join Table

In [ ]:
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Create DataFrames
married = pd.DataFrame({
    "emp_id": (1,2,3,4,5,6,7,8),
    "Married": ['John','James','Harper','Amy','Mia','Liz','Benjamin','Ava']
})

homeowners = pd.DataFrame({
    "emp_id": (9,10,11,12,5,6,7,8),
    "Homeowners": ['Sophia','William','Jacob','Michael','Mia','Liz','Benjamin','Ava']
})

# Sorting
married_sorted = married.sort_index(axis=1, ascending=False)
homeowners_sorted = homeowners.sort_values(by='emp_id', ascending=True)

# Print outputs
print(married_sorted)
print()
print(homeowners_sorted)

   emp_id   Married
0       1      John
1       2     James
2       3    Harper
3       4       Amy
4       5       Mia
5       6       Liz
6       7  Benjamin
7       8       Ava

   emp_id Homeowners
4       5        Mia
5       6        Liz
6       7   Benjamin
7       8        Ava
0       9     Sophia
1      10    William
2      11      Jacob
3      12    Michael

In [ ]:
# Print outputs
married_sorted
homeowners_sorted

   emp_id   Married
0       1      John
1       2     James
2       3    Harper
3       4       Amy
4       5       Mia
5       6       Liz
6       7  Benjamin
7       8       Ava

   emp_id Homeowners
4       5        Mia
5       6        Liz
6       7   Benjamin
7       8        Ava
0       9     Sophia
1      10    William
2      11      Jacob
3      12    Michael

In [ ]:
#Find employees who are married and homemakers
consolidated = pd.merge(married, homeowners, on='emp_id', how='inner')
consolidated.sort_index(axis=1, ascending=False)

   emp_id   Married Homeowners
0       5       Mia        Mia
1       6       Liz        Liz
2       7  Benjamin   Benjamin
3       8       Ava        Ava

In [ ]:
#Find employees who are married and may or maynot be homemakers
consolidated = pd.merge(married, homeowners, on='emp_id', how='left')
consolidated.sort_index(axis=1, ascending=False)

   emp_id   Married Homeowners
0       1      John        NaN
1       2     James        NaN
2       3    Harper        NaN
3       4       Amy        NaN
4       5       Mia        Mia
5       6       Liz        Liz
6       7  Benjamin   Benjamin
7       8       Ava        Ava

In [ ]:
#Find employees who are homemakersand may or maynot be married
consolidated = pd.merge(married, homeowners, on='emp_id', how='right')
consolidated.sort_index(axis=1, ascending=False)

   emp_id   Married Homeowners
0       9       NaN     Sophia
1      10       NaN    William
2      11       NaN      Jacob
3      12       NaN    Michael
4       5       Mia        Mia
5       6       Liz        Liz
6       7  Benjamin   Benjamin
7       8       Ava        Ava

In [ ]:
#Find employees who are homemakersand or married
consolidated = pd.merge(married, homeowners, on='emp_id', how='outer')
consolidated.sort_index(axis=1, ascending=False)

    emp_id   Married Homeowners
0        1      John        NaN
1        2     James        NaN
2        3    Harper        NaN
3        4       Amy        NaN
4        5       Mia        Mia
5        6       Liz        Liz
6        7  Benjamin   Benjamin
7        8       Ava        Ava
8        9       NaN     Sophia
9       10       NaN    William
10      11       NaN      Jacob
11      12       NaN    Michael

Pandas Pivot table

In [ ]:
#Example 1: Load dataset
import pandas as pd
import seaborn as sns

tips = sns.load_dataset("tips")
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
#Example 2: Average total bill by day and time
pd.pivot_table(
    tips,
    values="tip",
    index="day",
    aggfunc="mean"
)

C:\Users\admin\AppData\Local\Temp\ipykernel_26172\2030870678.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pd.pivot_table(

           tip
day
Thur  2.771452
Fri   2.734737
Sat   2.993103
Sun   3.255132

In [ ]:
#Example 3: Multiple aggregations
pd.pivot_table(
    tips,
    values="total_bill",
    index="day",
    columns="time",
    aggfunc="mean"
)

C:\Users\admin\AppData\Local\Temp\ipykernel_26172\1606823654.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pd.pivot_table(

time      Lunch     Dinner
day
Thur  17.664754  18.780000
Fri   12.845714  19.663333
Sat         NaN  20.441379
Sun         NaN  21.410000

In [ ]:
##Example 3: Multiple aggregations
pd.pivot_table(
    tips,
    values="tip",
    index="day",
    aggfunc=["mean", "sum", "count"]
)

C:\Users\admin\AppData\Local\Temp\ipykernel_26172\4202257078.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pd.pivot_table(
C:\Users\admin\AppData\Local\Temp\ipykernel_26172\4202257078.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pd.pivot_table(
C:\Users\admin\AppData\Local\Temp\ipykernel_26172\4202257078.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pd.pivot_table(

          mean     sum count
           tip     tip   tip
day
Thur  2.771452  171.83    62
Fri   2.734737   51.96    19
Sat   2.993103  260.40    87
Sun   3.255132  247.39    76

In [ ]:
#Example 4: Pivot table with filters
pd.pivot_table(
    tips,
    values="tip",
    index="day",
    columns="sex",
    aggfunc="mean",
    margins=True
)

C:\Users\admin\AppData\Local\Temp\ipykernel_26172\2910197832.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pd.pivot_table(

sex       Male    Female       All
day
Thur  2.980333  2.575625  2.771452
Fri   2.693000  2.781111  2.734737
Sat   3.083898  2.801786  2.993103
Sun   3.220345  3.367222  3.255132
All   3.089618  2.833448  2.998279